9/data/attachments/79c08a9b0bd5d1d2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_a2f52e87-e0b5-4f03-88b9-e00689416176</nif:username>
            <nif:friendToBeAdded>Collin_certainly_Actions_60706_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>